# 1) Задать список из n чисел последовательности (1+1/n)**n и вывести на экран их сумму

# def sequence(n:int):
#     summa = 0
#     for i in range(1, n + 1):
#         summa += (1+1/i)**i 
#     return summa

# print(sequence(5))


# 2) Реализовать алгоритм перемешивания списка.

example_list = [1, 2, 3, 4, 5]




# 3)  Реализовать алгоритм задания случайных чисел. Без использования встроенного генератора псевдослучайных чисел
# Сложна


# 4) Определить, присутствует ли в заданном списке строк, некоторое число


# 5) Определить, позицию второго вхождения строки в списке либо сообщить, что её нет.
# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1